ch6/ch6-5.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-01 Tue 09:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 6.5</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="pedh" />
<link rel="stylesheet" type="text/css" href="/css/org-info.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/CLRS-Solutions"> UP </a>
 |
 <a accesskey="H" href="/CLRS-Solutions"> HOME </a>
</div><div id="content">
<h1 class="title">Chapter 6.5</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org47a93cd">ch6.5</a>
<ul>
<li><a href="#orgdad1c4c">6.5-1</a></li>
<li><a href="#org07d4eaf">6.5-2</a></li>
<li><a href="#orgdadf25f">6.5-3</a></li>
<li><a href="#org7014e52">6.5-4</a></li>
<li><a href="#org39b0c0d">6.5-5</a></li>
<li><a href="#org82a1d9b">6.5-6</a></li>
<li><a href="#org2a29f24">6.5-7</a></li>
<li><a href="#orgc4b183a">6.5-8</a></li>
<li><a href="#org6c10144">6.5-9</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org47a93cd" class="outline-2">
<h2 id="org47a93cd">ch6.5</h2>
<div class="outline-text-2" id="text-org47a93cd">
</div>
<div id="outline-container-orgdad1c4c" class="outline-3">
<h3 id="orgdad1c4c">6.5-1</h3>
<div class="outline-text-3" id="text-orgdad1c4c">
<pre class="example">
   (15 (13 (5 (4) (0)) (12 (6) (2))) (9 (8 (1)) (7)))
-&gt; (1 (13 (5 (4) (0)) (12 (6) (2))) (9 (8) (7)))       # extract 15
-&gt; (13 (12 (5 (4) (0)) (6 (1) (2))) (9 (8) (7))
</pre>
</div>
</div>
<div id="outline-container-org07d4eaf" class="outline-3">
<h3 id="org07d4eaf">6.5-2</h3>
<div class="outline-text-3" id="text-org07d4eaf">
<pre class="example">
   (15 (13 (5 (4) (0)) (12 (6) (2))) (9 (8 (1)) (7)))
-&gt; (15 (13 (5 (4) (0)) (12 (6) (2))) (9 (8 (1) (*10*)) (7)))
-&gt; (15 (13 (5 (4) (0)) (12 (6) (2))) (9 (*10* (1) (8)) (7)))
-&gt; (15 (13 (5 (4) (0)) (12 (6) (2))) (*10* (9 (1) (8)) (7)))
-&gt; (15 (13 (5 (4) (0)) (12 (6) (2))) (10 (9 (1) (8)) (7)))
</pre>
</div>
</div>
<div id="outline-container-orgdadf25f" class="outline-3">
<h3 id="orgdadf25f">6.5-3</h3>
<div class="outline-text-3" id="text-orgdadf25f">
<pre class="example">
HEAP-MINIMUM(A)
    return A[1]
</pre>
<pre class="example">
HEAP-EXTRACT-MIN(A)
    if A.heapsize &lt; 1
	error "heap underflow"
    min = A[1]
    A[1] = A[A.heapsize]
    A.heapsize = A.heapsize - 1
    MIN-HEAPIFY(A, 1)
    return min
</pre>
<pre class="example">
HEAP-DECREASE-KEY(A, i, key)
    if key &gt; A[i]
	error "new key is larger than current key"
    A[i] = key
    while i &gt; 1 and A[PARENT(i)] &gt; A[i]
	exchange A[i] with A[PARENT(i)]
	i = PARENT(i)
</pre>
<pre class="example">
MIN-HEAP-INSERT(A, key)
    A.heapsize = A.heapsize + 1
    A[A.heapsize] = \infty
    HEAP-DECREASE-KEY(A, A.heapsize, key)
</pre>
</div>
</div>
<div id="outline-container-org7014e52" class="outline-3">
<h3 id="org7014e52">6.5-4</h3>
<div class="outline-text-3" id="text-org7014e52">
<p>
Set the key to \(-\infty\) to keep the max heap and ensure that the desired
value is larger than the current value.
</p>
</div>
</div>
<div id="outline-container-org39b0c0d" class="outline-3">
<h3 id="org39b0c0d">6.5-5</h3>
<div class="outline-text-3" id="text-org39b0c0d">
<p>
<b>Initialization:</b> The subarray is same as the original max heap except
\(A[i] = key\), and there may exists one exception that \(A[i] = key\) may be
larger than \(A[PARENT(i)]\).
</p>

<p>
<b>Maintenance:</b> We exchange \(A[i]\) with \(A[PARENT(i)]\) if
\(A[i] > A[PARENT(i)]\), so the violation becomes that \(A[PARENT(i)]\) may
be larger than \(A[PARENT(PARENT(i))]\).
</p>

<p>
<b>Termination:</b> We terminates when \(i = 1\) or \(A[PARENT(i)] \leq A[i]\),
the violation is resolved, the subarray becomes a max heap.
</p>
</div>
</div>

<div id="outline-container-org82a1d9b" class="outline-3">
<h3 id="org82a1d9b">6.5-6</h3>
<div class="outline-text-3" id="text-org82a1d9b">
<pre class="example">
HEAP-INCREASE-KEY(A, i, key)
    if key &lt; A[i]
	error "new key is smaller than current key"
    while i &gt; 1 and A[PARENT(i)] &lt; A[i]
	A[i] = A[PARENT(i)]
	i = PARENT(i)
    A[i] = key
</pre>
</div>
</div>
<div id="outline-container-org2a29f24" class="outline-3">
<h3 id="org2a29f24">6.5-7</h3>
<div class="outline-text-3" id="text-org2a29f24">
<p>
<b>FIFO queue:</b> Use a min-priority queue, increase the priority on every
insertion.
</p>

<p>
<b>Stack:</b> Use a max-priority queue, increase the priority on every insertion
and decrease the priority on every extraction.
</p>

<p>
Note that the priority would keep increasing on total in a FIFO queue, so we
need to consider reassignment of the priorities.
</p>
</div>
</div>
<div id="outline-container-orgc4b183a" class="outline-3">
<h3 id="orgc4b183a">6.5-8</h3>
<div class="outline-text-3" id="text-orgc4b183a">
<pre class="example">
HEAP-DELETE(A, i)
    key = A[A.heap-size]
    if A[i] &gt; key
	A[i] = key
	MAX-HEAPIFY(A, i)
    else HEAP-INCREASE-KEY(A, i, key)
    A.heap-size = A.heap-size - 1
</pre>
</div>
</div>
<div id="outline-container-org6c10144" class="outline-3">
<h3 id="org6c10144">6.5-9</h3>
<div class="outline-text-3" id="text-org6c10144">
<pre class="example">
MERGE-SORTED-LISTS(L, k)
    let A[1..k] be a new array
    let B be a new array
    for i = 1 to k
	A[i].list-index = i
	A[i].index = 1
	A[i].key = L[i][1]
    BUILD-MIN-HEAP(A)
    while A.heap-size &gt; 0
	B.append(A[1].key)
	if A[1].index &lt; L[A[1].list-index].length
	    A[1].index = A[1].index + 1
	    A[1].key = L[A[1].list-index][A[1].index]
	else HEAP-EXTRACT-MIN(A)
    return B
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pedh</p>
<p class="date">Created: 2020-09-01 Tue 09:59</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
